src/cf/InformationRegisters/ИдентификаторыОбъектовВСервисахВнешнегоПодписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыОбъектовВСервисахВнешнегоПодписания</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сервис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СервисыВнешнегоПодписания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СопоставляемыеОбъектыВнешнегоПодписания</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ИдентификаторыОбъектовВСервисахВнешнегоПодписания/Ext/RecordSetModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Количество() <> 0 Тогда
		Возврат;
	КонецЕсли;
	
	Сервис = Отбор.Сервис.Значение; // СправочникСсылка.СервисыВнешнегоПодписания
	Объект = Отбор.Объект.Значение; // ОпределяемыйТип.СопоставляемыеОбъектыВнешнегоПодписания
	
	Если Не ЗначениеЗаполнено(Сервис) Или Не ЗначениеЗаполнено(Объект) Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Запись в регистр без установленного отбора не поддерживается'"));
		Возврат;
	КонецЕсли; 
	
	НаборЗаписей = РегистрыСведений.ИдентификаторыОбъектовВСервисахВнешнегоПодписания.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сервис.Установить(Сервис);
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВозможноУдалениеИдентификатораОбъекта = 
		РаботаСВнешнимПодписанием.ВозможноУдалениеИдентификатораОбъектаСервиса(Сервис, Объект);
	Если Не ВозможноУдалениеИдентификатораОбъекта Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Удаление записи невозможно, по этому объекту есть активные сведения о внешнем подписании'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
